library/app/controllers/books_controller.rb

  def list
    @books = Book.all.page(params[:page]).per(5)
---
SELECT  "books".* FROM "books" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books"

  def list2
    @books = Book.all
---
SELECT "books".* FROM "books"

  def search
    @search = params[:search]
    @method = params[:method]

    if @method == '前方一致'
      @books = Book.where("title LIKE ?", "#{@search}%")
    elsif @method == '後方一致'
      @books = Book.where("title LIKE ?", "%#{@search}")
    else
      @books = Book.where("title LIKE ?", "%#{@search}%")
    end

    if @books.length > 0
---
SELECT "books".* FROM "books" WHERE (title LIKE '%%')
SELECT COUNT(*) FROM "books" WHERE (title LIKE '%%')
SELECT "books".* FROM "books" WHERE (title LIKE 'JAVA%')