library/app/controllers/reserves_controller.rb

INSERT INTO "reserves" ("book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 5], ["user_id", 1], ["created_at", "2022-04-02 04:11:14.073886"], ["updated_at", "2022-04-02 04:11:14.073886"]]
UPDATE "books" SET "hold" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["hold", 5], ["updated_at", "2022-04-10 09:24:26.973836"], ["id", 2]]
INSERT INTO "reserves" ("book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 2], ["user_id", 1], ["created_at", "2022-04-10 09:24:27.114606"], ["updated_at", "2022-04-10 09:24:27.114606"]]
---
  def create
    @reserve = Reserve.new(user_id: @current_user.id, book_id: params[:book_id])
    @book = @reserve.book
    if @book.hold > 0 then
      @book.hold -= 1
      @book.save
      @reserve.save

SELECT  "reserves".* FROM "reserves" WHERE "reserves"."user_id" = ? AND "reserves"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 5], ["LIMIT", 1]]
UPDATE "books" SET "hold" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["hold", 1], ["updated_at", "2022-04-02 04:11:28.389964"], ["id", 5]]
DELETE FROM "reserves" WHERE "reserves"."id" = ?  [["id", 5]]
---
  def destroy
    @reserve = Reserve.find_by(user_id: @current_user.id, book_id: params[:book_id])
    @book = @reserve.book
    @book.hold += 1
    @book.save
    @reserve.destroy

SELECT "reserves".* FROM "reserves" WHERE "reserves"."flag" = ?  [["flag", 1]]
---
  def list
    @reserves = Reserve.where(flag: nil)

SELECT  "reserves".* FROM "reserves" WHERE "reserves"."user_id" = ? AND "reserves"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 2], ["LIMIT", 1]]
UPDATE "users" SET "level" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["level", "予約なし"], ["updated_at", "2022-04-02 04:55:50.091530"], ["id", 4]]
UPDATE "reserves" SET "flag" = ?, "updated_at" = ? WHERE "reserves"."id" = ?  [["flag", 1], ["updated_at", "2022-04-10 08:59:58.529574"], ["id", 10]]
---
  def lending
    @reserve = Reserve.find_by(user_id: params[:user_id], book_id: params[:book_id])
    @reserve.flag = 1
    @reserve.save

SELECT  "reserves".* FROM "reserves" WHERE "reserves"."user_id" = ? AND "reserves"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 2], ["LIMIT", 1]]
UPDATE "reserves" SET "flag" = ?, "updated_at" = ? WHERE "reserves"."id" = ?  [["flag", nil], ["updated_at", "2022-04-10 09:06:09.862332"], ["id", 10]]
UPDATE "books" SET "hold" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["hold", 6], ["updated_at", "2022-04-10 09:23:58.532238"], ["id", 2]]
UPDATE "reserves" SET "flag" = ?, "updated_at" = ? WHERE "reserves"."id" = ?  [["flag", nil], ["updated_at", "2022-04-10 09:23:58.699279"], ["id", 13]]
DELETE FROM "reserves" WHERE "reserves"."id" = ?  [["id", 13]]
---
  def cancel
    @reserve = Reserve.find_by(user_id: params[:user_id], book_id: params[:book_id])
    @book = @reserve.book
    @reserve.flag = nil
    @book.hold += 1
    @book.save
    @reserve.save
    @reserve.destroy