library/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "post_code", "address", "phone_number", "sex", "birthday", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @reserves = Reserve.where(user_id: @user.id, flag: nil)
---
SELECT "reserves".* FROM "reserves" WHERE "reserves"."user_id" = ? AND "reserves"."flag" = ?  [["user_id", 4], ["flag", 1]]

  def withdraw
    session[:user_id] = nil
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]

  def list
    @users = User.all
---
SELECT "users".* FROM "users"