library/app/views/books/show.html.erb

      <div class="post-menus">
        <% if Reserve.find_by(user_id: @current_user.id, book_id: @book.id,flag: nil) %>
  　       <%= link_to("予約を取り消す","/reserves/#{@book.id}/destroy",{method: :post, data: {confirm: '予約を取り消しますか？'}}) %>
        <% elsif Reserve.find_by(user_id: @current_user.id, book_id: @book.id,flag: 1) %>
          <% t = Reserve.find_by(user_id: @current_user.id, book_id: @book.id,flag: 1).updated_at %>
---
SELECT  "reserves".* FROM "reserves" WHERE "reserves"."user_id" = ? AND "reserves"."book_id" = ? AND "reserves"."flag" IS NULL LIMIT ?  [["user_id", 4], ["book_id", 2], ["LIMIT", 1]]
SELECT  "reserves".* FROM "reserves" WHERE "reserves"."user_id" = ? AND "reserves"."book_id" = ? AND "reserves"."flag" = ? LIMIT ?  [["user_id", 4], ["book_id", 5], ["flag", 1], ["LIMIT", 1]]
SELECT  "reserves".* FROM "reserves" WHERE "reserves"."user_id" = ? AND "reserves"."book_id" = ? AND "reserves"."flag" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["flag", 1], ["LIMIT", 1]]